#include<iostm8l152R8.h>  /*  头文件 */
#include "i2cds1307.h"

#define uchar unsigned char


//---DS1302写入和读取时分秒的地址命令---//
//---秒分时日月周年 最低位读写位;-------//
uchar READ_RTC_ADDR[7] = {0x81, 0x83, 0x85, 0x87, 0x89, 0x8b, 0x8d}; 
uchar WRITE_RTC_ADDR[7] = {0x80, 0x82, 0x84, 0x86, 0x88, 0x8a, 0x8c};

//---DS1302时钟初始化2013年1月1日星期二12点00分00秒。---//
//---存储顺序是秒分时日月周年,存储格式是用BCD码---//
uchar TIME[7] = {0, 0x40, 0x18, 0x01, 0x01, 0x02, 0x18};

//前三位表示秒/分/时  0X39表示39分

/*******************************************************************************
* 函 数 名         : void Close_DS1302()
* 函数功能	   : 关闭DS1302.
* 输    入         : 无
* 输    出         : 无
*******************************************************************************/
void Close_DS1302()
{
  PC_ODR_bit.ODR5=0;//RST
  PC_ODR_bit.ODR6=0;//DAT
  PC_ODR_bit.ODR7=0;//CLK
}
/*******************************************************************************
* 函 数 名         : Ds1302Init
* 函数功能	   : 初始化DS1302.
* 输    入         : 无
* 输    出         : 无
*******************************************************************************/
void Ds1302Init()
{
  uchar n;
  PC_DDR_bit.DDR5=1;PC_CR1_bit.C15=1;PC_CR2_bit.C25=1;//RST
  PC_DDR_bit.DDR6=1;PC_CR1_bit.C16=1;PC_CR2_bit.C26=1;//DAT
  PC_DDR_bit.DDR7=1;PC_CR1_bit.C17=1;PC_CR2_bit.C27=0;//CLK
  
  
  Ds1302Write(0x8E,0X00);		 //禁止写保护，就是关闭写保护功能
  for (n=0; n<7; n++)//写入7个字节的时钟信号：分秒时日月周年
  {
    Ds1302Write(WRITE_RTC_ADDR[n],TIME[n]);	
  }
  
  Ds1302Write(0x8E,0x80);		 //打开写保护功能
}

/*******************************************************************************
* 函 数 名         : Set_1307Time()
* 函数功能	   : 设置时间
* 输    入         : 无
* 输    出         : 无
*******************************************************************************/
void Set_1307Time()
{
  uchar n;
  
  Ds1302Write(0x8E,0X00);		 //禁止写保护，就是关闭写保护功能
  for (n=0; n<7; n++)//写入7个字节的时钟信号：分秒时日月周年
  {
    Ds1302Write(WRITE_RTC_ADDR[n],TIME[n]);	
  }
  Ds1302Write(0x8E,0x80);		 //打开写保护功能
}

/*******************************************************************************
* 函 数 名         : Ds1302ReadTime
* 函数功能	   : 读取时钟信息
* 输    入         : 无
* 输    出         : 无
*******************************************************************************/
void Ds1302ReadTime()
{
  uchar n;
  for (n=0; n<7; n++)//读取7个字节的时钟信号：分秒时日月周年
  {
    TIME[n] = Ds1302Read(READ_RTC_ADDR[n]);
  }	
}

/*******************************************************************************
* 函 数 名         : Ds1302Write
* 函数功能	   : 向DS1302命令（地址+数据）
* 输    入         : addr,dat
* 输    出         : 无
*******************************************************************************/
void Ds1302Write(uchar addr, uchar dat)
{
	uchar n;
        SET_OUT();
	RST = 0;
	asm("nop");
	SCLK = 0;//先将SCLK置低电平。
	asm("nop");
	RST = 1; //然后将RST(CE)置高电平。
	asm("nop");

	for (n=0; n<8; n++)//开始传送八位地址命令
	{
		DSIO_OUT = addr & 0x01;//数据从低位开始传送
		addr >>= 1;
		SCLK = 1;//数据在上升沿时，DS1302读取数据
		asm("nop");
		SCLK = 0;
		asm("nop");
	}
	for (n=0; n<8; n++)//写入8位数据
	{
		DSIO_OUT = dat & 0x01;
		dat >>= 1;
		SCLK = 1;//数据在上升沿时，DS1302读取数据
		asm("nop");
		SCLK = 0;
		asm("nop");
	}	
		 
	RST = 0;//传送数据结束
	asm("nop");
}

/*******************************************************************************
* 函 数 名         : Ds1302Read
* 函数功能		   : 读取一个地址的数据
* 输    入         : addr
* 输    出         : dat
*******************************************************************************/

uchar Ds1302Read(uchar addr)
{
	uchar n,dat,dat1;
        SET_OUT();
	RST = 0;
	asm("nop");
	SCLK = 0;//先将SCLK置低电平。
	asm("nop");
	RST = 1;//然后将RST(CE)置高电平。
	asm("nop");
        
	for(n=0; n<8; n++)//开始传送八位地址命令
	{
		DSIO_OUT = addr & 0x01;//数据从低位开始传送
		addr >>= 1;
		SCLK = 1;//数据在上升沿时，DS1302读取数据
		asm("nop");
		SCLK = 0;//DS1302下降沿时，放置数据
		asm("nop");
	}
	asm("nop");
        SET_IN();
	for(n=0; n<8; n++)//读取8位数据
	{
		dat1 = DSIO_IN;//从最低位开始接收
		dat = (dat>>1) | (dat1<<7);
		SCLK = 1;
		asm("nop");
		SCLK = 0;//DS1302下降沿时，放置数据
		asm("nop");
	}
        SET_OUT();
	RST = 0;
	asm("nop");	//以下为DS1302复位的稳定时间,必须的。
	SCLK = 1;
	asm("nop");
	DSIO_OUT = 0;
	asm("nop");
	DSIO_OUT = 1;
	asm("nop");
	return dat;
}